https://machinelearningmastery.com/multivariate-time-series-forecasting-lstms-keras/  
https://www.justintodata.com/forecast-time-series-lstm-with-tensorflow-keras/

In [36]:
import pandas as pd
import warnings
import datetime
warnings.filterwarnings('ignore')

Vix index with data cut down to first of month only

In [37]:
vix_df = pd.read_csv('/home/jeremy/data/eco/^VIX.csv')

In [38]:
vix_df

,Date,Open,High,Low,Close,Adj Close,Volume
0,1990-01-02,17.240000,17.240000,17.240000,17.240000,17.240000,0
1,1990-01-03,18.190001,18.190001,18.190001,18.190001,18.190001,0
2,1990-01-04,19.219999,19.219999,19.219999,19.219999,19.219999,0
3,1990-01-05,20.110001,20.110001,20.110001,20.110001,20.110001,0
4,1990-01-08,20.260000,20.260000,20.260000,20.260000,20.260000,0
...,...,...,...,...,...,...,...
7730,2020-09-04,34.619999,38.279999,29.500000,30.750000,30.750000,0
7731,2020-09-08,30.610001,35.930000,30.520000,31.459999,31.459999,0
7732,2020-09-09,31.680000,31.780001,28.120001,28.809999,28.809999,0
7733,2020-09-10,28.670000,30.559999,27.590000,29.709999,29.709999,0
7734,2020-09-11,28.629999,29.730000,26.510000,26.870001,26.870001,0

In [39]:
vix_df = vix_df[['Date','Close']]
vix_df['Date']=  pd.to_datetime(vix_df['Date'], format='%Y-%m-%d')
vix_df = vix_df.groupby(pd.Grouper(key='Date',freq="1M")).nth(0)   
vix_df.reset_index(drop=True,inplace=True)

In [40]:
vix_df

          Date      Close
0   1990-01-02  17.240000
1   1990-02-01  24.870001
2   1990-03-01  21.900000
3   1990-04-02  22.840000
4   1990-05-01  18.430000
..         ...        ...
364 2020-05-01  37.189999
365 2020-06-01  28.230000
366 2020-07-01  28.620001
367 2020-08-03  24.280001
368 2020-09-01  26.120001

[369 rows x 2 columns]

https://stackoverflow.com/questions/25797038/filter-data-to-get-only-first-day-of-the-month-rows

==================================================================================================================

CPI

In [43]:
cpi_df = pd.read_csv('/home/jeremy/data/eco/CPIAUCSL.csv')

In [44]:
cpi_df['Date']=  pd.to_datetime(cpi_df['DATE'], format='%Y-%m-%d')

===============================================================================================================

Dow Jones Transport

In [52]:
djt_df = pd.read_csv('/home/jeremy/data/eco/^DJT.csv')

In [49]:
djt_df = djt_df[['Date','Close']]

In [50]:
djt_df['Date']=  pd.to_datetime(djt_df['Date'], format='%Y-%m-%d')
djt_df = djt_df.groupby(pd.Grouper(key='Date',freq="1M")).nth(0)   
djt_df.reset_index(drop=True,inplace=True)

In [51]:
djt_df.head()

        Date        Close
0 1992-01-02  1342.099976
1 1992-02-03  1362.500000
2 1992-03-02  1443.000000
3 1992-04-01  1381.199951
4 1992-05-01  1359.500000

===============================================================================================================

2 yr note

In [58]:
twoyr_df = pd.read_csv('/home/jeremy/data/eco/DGS2.csv')

In [60]:
twoyr_df.columns = ['Date','Close']
twoyr_df['Date']=  pd.to_datetime(twoyr_df['Date'], format='%Y-%m-%d')
twoyr_df = twoyr_df.groupby(pd.Grouper(key='Date',freq="1M")).nth(0)   
twoyr_df.reset_index(drop=True,inplace=True)

In [61]:
twoyr_df

          Date  Close
0   1990-01-02  7.870
1   1990-02-01  8.280
2   1990-03-01  8.530
3   1990-04-02  8.620
4   1990-05-01  9.020
..         ...    ...
365 2020-06-01   0.14
366 2020-07-01   0.17
367 2020-08-03   0.11
368 2020-09-01   0.13
369 2020-10-01   0.14

[370 rows x 2 columns]

===============================================================================================================

10 yr note

In [64]:
tenyr_df = pd.read_csv('/home/jeremy/data/eco/DGS10.csv')
tenyr_df.columns = ['Date','Close']
tenyr_df['Date']=  pd.to_datetime(tenyr_df['Date'], format='%Y-%m-%d')
tenyr_df = tenyr_df.groupby(pd.Grouper(key='Date',freq="1M")).nth(0)   
tenyr_df.reset_index(drop=True,inplace=True)

In [65]:
tenyr_df

          Date Close
0   1990-01-02  7.94
1   1990-02-01  8.42
2   1990-03-01  8.59
3   1990-04-02  8.65
4   1990-05-01  9.08
..         ...   ...
365 2020-06-01  0.66
366 2020-07-01  0.69
367 2020-08-03  0.56
368 2020-09-01  0.68
369 2020-10-01  0.68

[370 rows x 2 columns]